Revit 2027 API
ParameterTypeId.RebarSystemHookTypeTopDirn2 Property
 "Top Minor Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookTypeTopDirn2 { get; }
Public Shared ReadOnly Property RebarSystemHookTypeTopDirn2 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookTypeTopDirn2 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookTypeTopDirn2 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace